{"80170":{"475":{"id":475,"nome":"Atividade 1 - Etapa 1","peso":10,"numero":11,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-02-08","enunciado":"Lista de exercício de introdução a banco de dados"},"485":{"id":485,"nome":"Atividade 5 - Etapa 1","peso":40,"numero":15,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-03-30","enunciado":"Crie um vídeo explicando os conceitos presentes no mapa mental.O Video deve ser feito no formato vertical e deve possuir de 40 até 60 segundos.Poste o link do vídeo no comentário dessa atividade."},"486":{"id":486,"nome":"Atividade 4 - Etapa 1","peso":40,"numero":14,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-03-30","enunciado":"Prezado/a,Crie um mapa mental explicando o modelo relacional.OBS: Leia as informações de como fazer o mapa mental no link anexo🙎‍♂️ Essa atividade deve ser feita individualmente🧠 O mapa mental deve ter pelo menos 15 palavras-chaves(balões). 📝 Você deve criar o mapa mental de forma manual usando papel e caneta.🚨 Não serão aceitos mapas mentais feitos por meio de programas.⚠️ Quanto terminar tire uma foto das respostas no seu caderno/folhas e poste no SUAP.👨‍🎓 Tente criar mapas metais que explique os conceitos de forma clara e que abrange todo o conteúdo"},"494":{"id":494,"nome":"Atividade 2 - Etapa 1","peso":10,"numero":12,"nota":80,"feedback":null,"etapa":1,"prazo":"","enunciado":"1. O que significa DDL e qual é a sua função? 2. Qual é a importância de escolher o tipo de dado apropriado para cada coluna?","aluno":"20211INFI_PINHE0019"},"notas":{"Etapa 1":0.8,"Etapa 2":null,"Etapa 3":null,"Etapa 4":null,"Recuperação Etapa 1":null,"Recuperação Etapa 2":null,"Recuperação Etapa 3":null,"Prova Final":null,"Média das notas":0.2},"nome":"BANCO DE DADOS I - Inf 2022 Mat ","etapas":4,"id":80170,"observacao":"Você tirou uma nota inferior a 7 na etapa 1. Por isso você deve fazer a(s) atividade(s) de recuperação dessa etapa. até o prazo estipulado<br>Em caso de dúvidas procure o professor por e-mail ou whatappp"},"80175":{"480":{"id":480,"nome":"Atividade 3 - Etapa 1","peso":10,"numero":13,"nota":"?","feedback":"-","etapa":1,"prazo":"","enunciado":"Responda as seguintes perguntas: O que é um sistema Operacional? Quais são as principais funções de um sistema operacional?"},"487":{"id":487,"nome":"Atividade 2 - Etapa 1","peso":30,"numero":12,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-03-31","enunciado":"Faça um video de divulgação do seu jogo de tabuleiro.O video deve ser feito no formato vestical e possuir menos de 60 segundos"},"488":{"id":488,"nome":"Atividade 1 -  Etapa 1","peso":60,"numero":11,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-03-30","enunciado":"Desenvolva um jogo de tabuleiro sobre Sistemas Operacionais.Você deve fazer um tabuleiro que permita vários jogadores participarem e cada jogador é representado por uma peça no tabuleiro.O jogo deve ser multiplayer de 2 até 4 jogadores e deve possuir pelos menos 30 casas.O jogo deve possuir perguntas de verdadeiro ou falso de diferentes tipos de dificuldades.Em cada rodada o jogador deve responder perguntas sobre conceitos de sistemas operacionais.O jogo deve possuir pelo menos 40 perguntas sobre os seguintes temas:- Introdução a sistemas operacionais- Monitor de sistema- Interface gráfica- Diferenças entre sistemas operacionais e linha de comando- Sistemas operacionais monotarefa- Sistemas operacionais multitarefa- Chamadas de sistemas- Abstração de recursos- Categorias de sistemas operacionais OBS: pode ser feito de duplas ou trios.Critérios de avaliação:Qualidade gráfica do tabuleiroQualidade do material do tabuleiroQuantidade das perguntasQualidade das perguntasQualidade dos cartões Qualidade dos matérias do dado e dos marcadoreshttps://www.sesc-sc.com.br/lazer/sugestao-de-como-criar-seu-proprio-jogo-de-tabuleiro--#:~:text=Como%20fazer%3F,ser%C3%A3o%20as%20cartas%20do%20jogo.https://ebaconline.com.br/projetos-em-games?utm_source=google&utm_medium=cpc&utm_campaign=course_30_game-design_google_search_all_conversions_all&utm_content=c_10974524574|adg_105721927337|ad_484299512565|ph_kwd-313284260134|key_como%20desenvolver%20um%20jogo|dev_c|pst_|rgnid_1031908|placement_&gclid=CjwKCAjw_MqgBhAGEiwAnYOAerxwh3NQdantHomsNhCFEIwq7VrxUBNMbEgnnRo3VDPWOHs9YtdLQBoC7twQAvD_BwE"},"notas":{"Etapa 1":0,"Etapa 2":null,"Etapa 3":null,"Etapa 4":null,"Recuperação Etapa 1":null,"Recuperação Etapa 2":null,"Recuperação Etapa 3":null,"Prova Final":null,"Média das notas":0},"nome":"SISTEMAS OPERACIONAIS - Inf 2022 Mat","etapas":4,"id":80175,"observacao":"Você tirou uma nota inferior a 7 na etapa 1. Por isso você deve fazer a(s) atividade(s) de recuperação dessa etapa. até o prazo estipulado<br>Em caso de dúvidas procure o professor por e-mail ou whatappp"},"80266":{"473":{"id":473,"nome":"Atividade 1 - Etapa 1","peso":10,"numero":11,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-02-01","enunciado":"Texto sobre as expectativas com o curso"},"474":{"id":474,"nome":"Atividade 2 - Etapa 1","peso":10,"numero":12,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-02-08","enunciado":"Escreva a receita de bolo favalorito. Sendo que você deve descrever a entrada, processamento e saída."},"489":{"id":489,"nome":"Atividade 4 - Etapa 1","peso":30,"numero":14,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-04-05","enunciado":"Cada equipe deve criar um video explicando como desenvolver o software de doação de sangue.Você deve apresentar a interface do aplicativo e a lógica de programação(blocos) desenvolvidos.Poste o link do vídeo no comentário dessa atividade.Você pode fazer o upload do vídeo no instagram, youtube, google drive ou qualquer ferramenta de compartilhamento de vídeo."},"490":{"id":490,"nome":"Atividade 3 - Etapa 1","peso":50,"numero":13,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-04-05","enunciado":"Prezado/a,Nesta atividade você deve criar um software utilizando a ferramenta appinvertor que mostre informação sobre doação de sangue.O software deve possuir as seguintes informações:- Condições básicas para doar sangue- Quem não pode doar- Recomendações para o dia da doação- O que acontece depois da doação- O que acontece com o sangue doadoCritérios de avaliação da atividade:- Qualidade da informação - Designer do aplicativo- Usabilidade do aplicativo - Qualidade de algoritmos presentes no software;- Quantidade de algoritmos presentes no software;OBS: Recomendo que você crie um formulário com uma lista de critérios para doação de sangue que a pessoa deve preencher. Quando a pessoa clicar no botão \"validar\", o formulário mostrará se ela pode ou não doar.OBS: Crie uma funcionalidade que permita à pessoa registrar a data na qual doou sangue e crie um alerta para lembrar quando poderá doar novamente.OBS: A atividade deve ser feita em equipes de no máximo 5 integrantes.Quando finalizar o trabalho, faça a publicação do aplicativo na galeria do app inventor.Assista o video para saber como publicar o aplicativo na galeria: https://www.youtube.com/watch?v=PPuERnhBZJQ&ab_channel=MeiraMeira"},"499":{"id":499,"nome":"Atividade 1 - Etapa 2","peso":10,"numero":21,"nota":"?","feedback":"-","etapa":2,"prazo":"2023-04-12","enunciado":"Faça um software que receba a nota do aluno e informe se ele precisa fazer a recuperação ou não.O aplicativo deve ter o seguinte comportamento:TRUE quando o aluno ficar de recuperação, isto é, sua nota é inferior a 7FALSE quando o aluno tirou nota igual ou superior a 7Você deve publicar o aplicativo na galeria do APP inventor e postar o link no comentário da atividade."},"notas":{"Etapa 1":null,"Etapa 2":null,"Etapa 3":null,"Etapa 4":null,"Recuperação Etapa 1":null,"Recuperação Etapa 2":null,"Recuperação Etapa 3":null,"Prova Final":null,"Média das notas":null},"nome":"LÓGICA DE PROGRAMAÇÃO -  Inf 2023 Mat","etapas":4,"id":80266,"observacao":"<br>Em caso de dúvidas procure o professor por e-mail ou whatappp"}}