{"80266":{"473":{"id":473,"nome":"Atividade 1 - Etapa 1","peso":10,"numero":11,"nota":100,"feedback":null,"etapa":1,"prazo":"2023-02-01","enunciado":"Texto sobre as expectativas com o curso","aluno":"20231INFI_PINHE0012"},"474":{"id":474,"nome":"Atividade 2 - Etapa 1","peso":10,"numero":12,"nota":100,"feedback":null,"etapa":1,"prazo":"2023-02-08","enunciado":"Escreva a receita de bolo favalorito. Sendo que você deve descrever a entrada, processamento e saída.","aluno":"20231INFI_PINHE0012"},"489":{"id":489,"nome":"Atividade 4 - Etapa 1","peso":30,"numero":14,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-04-05","enunciado":"Cada equipe deve criar um video explicando como desenvolver o software de doação de sangue.Você deve apresentar a interface do aplicativo e a lógica de programação(blocos) desenvolvidos.Poste o link do vídeo no comentário dessa atividade.Você pode fazer o upload do vídeo no instagram, youtube, google drive ou qualquer ferramenta de compartilhamento de vídeo."},"490":{"id":490,"nome":"Atividade 3 - Etapa 1","peso":50,"numero":13,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-04-05","enunciado":"Prezado/a,Nesta atividade você deve criar um software utilizando a ferramenta appinvertor que mostre informação sobre doação de sangue.O software deve possuir as seguintes informações:- Condições básicas para doar sangue- Quem não pode doar- Recomendações para o dia da doação- O que acontece depois da doação- O que acontece com o sangue doadoCritérios de avaliação da atividade:- Qualidade da informação - Designer do aplicativo- Usabilidade do aplicativo - Qualidade de algoritmos presentes no software;- Quantidade de algoritmos presentes no software;OBS: Recomendo que você crie um formulário com uma lista de critérios para doação de sangue que a pessoa deve preencher. Quando a pessoa clicar no botão \"validar\", o formulário mostrará se ela pode ou não doar.OBS: Crie uma funcionalidade que permita à pessoa registrar a data na qual doou sangue e crie um alerta para lembrar quando poderá doar novamente.OBS: A atividade deve ser feita em equipes de no máximo 5 integrantes.Quando finalizar o trabalho, faça a publicação do aplicativo na galeria do app inventor.Assista o video para saber como publicar o aplicativo na galeria: https://www.youtube.com/watch?v=PPuERnhBZJQ&ab_channel=MeiraMeira"},"499":{"id":499,"nome":"Atividade 1 - Etapa 2","peso":10,"numero":21,"nota":"?","feedback":"-","etapa":2,"prazo":"2023-04-12","enunciado":"Faça um software que receba a nota do aluno e informe se ele precisa fazer a recuperação ou não.O aplicativo deve ter o seguinte comportamento:TRUE quando o aluno ficar de recuperação, isto é, sua nota é inferior a 7FALSE quando o aluno tirou nota igual ou superior a 7Você deve publicar o aplicativo na galeria do APP inventor e postar o link no comentário da atividade."},"notas":{"Etapa 1":2,"Etapa 2":null,"Etapa 3":null,"Etapa 4":null,"Recuperação Etapa 1":null,"Recuperação Etapa 2":null,"Recuperação Etapa 3":null,"Prova Final":null,"Média das notas":0.5},"nome":"LÓGICA DE PROGRAMAÇÃO -  Inf 2023 Mat","etapas":4,"id":80266,"observacao":"Você tirou uma nota inferior a 7 na etapa 1. Por isso você deve fazer a(s) atividade(s) de recuperação dessa etapa. até o prazo estipulado<br>Em caso de dúvidas procure o professor por e-mail ou whatappp"}}