{"80268":{"491":{"id":491,"nome":"Atividade 5 - Etapa 1","peso":30,"numero":15,"nota":100,"feedback":null,"etapa":1,"prazo":"2023-03-30","enunciado":"Cada equipe deve criar um video explicando como desenvolver o software de doação de sangue.\nVocê deve apresentar a interface do aplicativo e a lógica de programação(blocos) desenvolvidos.\n\nPoste o link do vídeo no comentário dessa atividade.\nVocê pode fazer o upload do vídeo no instagram, youtube, google drive ou qualquer ferramenta de compartilhamento de vídeo.","aluno":"20231INFI_PINHE0001"},"492":{"id":492,"nome":"Atividade 4 - Etapa 1","peso":40,"numero":14,"nota":95,"feedback":null,"etapa":1,"prazo":"2023-03-30","enunciado":"Prezado/a,\n\nNesta atividade você deve criar um software utilizando a ferramenta appinvertor que mostre informação sobre doação de sangue.\nO software deve possuir as seguintes informações:\n- Condições básicas para doar sangue\n- Quem não pode doar\n- Recomendações para o dia da doação\n- O que acontece depois da doação\n- O que acontece com o sangue doado\n\n\nCritérios de avaliação da atividade:\n- Qualidade da informação \n- Designer do aplicativo\n- Usabilidade do aplicativo \n- Qualidade de algoritmos presentes no software;\n- Quantidade de algoritmos presentes no software;\n\n\nOBS: Recomendo que você crie um formulário com uma lista de critérios para doação de sangue que a pessoa deve preencher. Quando a pessoa clicar no botão \"validar\", o formulário mostrará se ela pode ou não doar.\n\nOBS: Crie uma funcionalidade que permita à pessoa registrar a data na qual doou sangue e crie um alerta para lembrar quando poderá doar novamente.\n\nOBS: A atividade deve ser feita em equipes de no máximo 5 integrantes.\n\nQuando finalizar o trabalho, faça a publicação do aplicativo na galeria do app inventor.\nAssista o video para saber como publicar o aplicativo na galeria: https://www.youtube.com/watch?v=PPuERnhBZJQ&ab_channel=MeiraMeira","aluno":"20231INFI_PINHE0001"},"495":{"id":495,"nome":"Atividade 1 - Etapa 1","peso":10,"numero":11,"nota":100,"feedback":null,"etapa":1,"prazo":"","enunciado":"Qual é sua perspectiva sobre o curso","aluno":"20231INFI_PINHE0001"},"496":{"id":496,"nome":"Atividade 2 - Etapa 1","peso":10,"numero":12,"nota":100,"feedback":null,"etapa":1,"prazo":"","enunciado":"Faça um algoritmo de uma receita de bolo","aluno":"20231INFI_PINHE0001"},"497":{"id":497,"nome":"Atividade 3 - Etapa 1","peso":10,"numero":13,"nota":100,"feedback":null,"etapa":1,"prazo":"","enunciado":"Descreva na forma de algoritmo o passo a passo que realizamos até chegar no campus","aluno":"20231INFI_PINHE0001"},"500":{"id":500,"nome":"Atividade 1 - Etapa 2","peso":10,"numero":21,"nota":1,"feedback":null,"etapa":2,"prazo":"2023-04-12","enunciado":"Faça um software que receba a nota do aluno e informe se ele precisa fazer a recuperação ou não.\nO aplicativo deve ter o seguinte comportamento:\nTRUE quando o aluno ficar de recuperação, isto é, sua nota é inferior a 7\nFALSE quando o aluno tirou nota igual ou superior a 7\n\nVocê deve publicar o aplicativo na galeria do APP inventor e postar o link no comentário da atividade.","aluno":"20231INFI_PINHE0001"},"510":{"id":510,"nome":"Atividade 2 - Recuperação da Etapa 1","peso":0,"numero":0,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-04-12","enunciado":"Prazo: 11/04/2023\n\nPrezad@,\n\nNessa atividade você deve gravar um VÍDEO explicando os operadores relacionais e aritméticos utilizados na construção de algoritmos.\n\n⚠️ Você não precisa aparecer no vídeo. \n\n⚠️ Recomendo que você faça um vídeo na forma de apresentação no CANVA.COM e faça comentários em áudio sobre os conteúdos.\n⚠️ Outra opção é fazer uma apresentação na forma de slide e grave a tela do celular do computador e faça comentários em áudio.\n\n📺 A Resolução do vídeo deve ser de 720p. Evite fazer gravações com qualidade superior para evitar que o arquivo fique muito grande.\n📲 Você utilize seu celular para gravar o vídeo e/ou áudio.\n🙋‍♂️ Não esqueça de se apresentar no início do vídeo.\n🎤 Preste atenção na qualidade do áudio para que sua voz não fique baixa.\n🤳 Treine antes de realizar a gravação.\n📌 Tenha segurança no que você fala.\n\n \n\n📨 Coloque o link do vídeo no comentário da atividade no SUAP.\n\n📺 Você pode postar o vídeo no YouTube como não listado.\n\n📺 Outra opção é colocar o arquivo no Google Drive e compartilha-lo. Não esqueça de dar acesso ao vídeo a todos que conhecem o link dele.\n\n[Como compartilhar arquivos](https://www.notion.so/Como-compartilhar-arquivos-13bf89a1010a4e90b5fa351c3eebefae)\n\n[Como gravar vídeos](https://www.notion.so/Como-gravar-v-deos-b62b6259d8e24b0d9757d45fb5e11e74)"},"511":{"id":511,"nome":"Atividade 1 - Recuperação da Etapa 1","peso":0,"numero":0,"nota":"?","feedback":"-","etapa":1,"prazo":"2023-04-12","enunciado":"Prazo: 11/04/2023\n\nPrezad@,\n\nFaça um MAPA MENTAL sobre os operadores relacionais e aritméticos utilizados na construção de algoritmos.\n\n🙎‍♂️ Esta atividade deve ser realizada individualmente.\n🧠 O mapa mental deve conter pelo menos 15 palavras-chave (balões).\n📝 Você deve criar o mapa mental manualmente, utilizando papel e caneta.\n🚨 Mapas mentais criados por meio de programas não serão aceitos.\n⚠️ Quando terminar, tire fotos das respostas no seu caderno/folhas e poste no SUAP.\n👨‍🎓 Tente criar mapas mentais que expliquem os conceitos de forma clara e abranjam todo o conteúdo.\n\n[Como fazer mapa mental](https://www.notion.so/Como-fazer-mapa-mental-ee5080b75cb947f693c73696d77b94ba)"},"512":{"id":512,"nome":"Atividade 2 - Etapa 2","peso":0,"numero":0,"nota":"?","feedback":"-","etapa":2,"prazo":"2023-04-13","enunciado":"Nesta atividade, você deve definir o tema do trabalho final desta disciplina. Para isso, selecione um assunto das disciplinas de Química, Física e Matemática que possua alguma fórmula. Crie um sistema informatizado que explique esse assunto e que possua um algoritmo para calcular a fórmula.\n\nObservações:\n\n- Forme equipes de até 4 integrantes.\n- As equipes não devem ter o mesmo tema."},"notas":{"Etapa 1":9.8,"Etapa 2":null,"Etapa 3":null,"Etapa 4":null,"Recuperação Etapa 1":null,"Recuperação Etapa 2":null,"Recuperação Etapa 3":null,"Prova Final":null,"Média das notas":null},"nome":"LÓGICA DE PROGRAMAÇÃO -  Inf 2023 Vesp","etapas":4,"id":80268,"observacao":"<br>Em caso de dúvidas procure o professor por e-mail ou whatappp"}}